
import java.util.Arrays;
import java.util.Scanner;

public class ArraysFindMinMaxelement {
    public static void main(String args[])
    {
        System.out.println("----------------------------------------------------------------------");
        System.out.println("Намиране на максимален елемент в масив");  
        System.out.println("----------------------------------------------------------------------");      
        //Да напишем по-интересен пример
        //да проверим дали дадено число се съдържа в целочислен масив
        int[] array3;
        array3 = new int[10];
        
        //Въеждаме стойности в масива
        Scanner s = new Scanner(System.in);
        System.out.println("Въведете "+array3.length+" елемента");  
        for (int i=0; i<array3.length;i++)
            array3[i] = s.nextInt();
        
        int temp;//тази променлива е необходимо, за да се запомня текущо най-голямото намерено число при я стъпка от обхождането на масива
        temp = array3[0];//променливата трябва да се инициализира. 
        //А най-подходящата стойност е първия елемент...
        //започваме обхождането от първи елемент и докато не сме проверли следващите ...
        //първият е най-голямото намерено число
        
        
        //да използваме друга конструкция за обхождане на масив
        //отново конструкция за цикъл, но изполавана само за масиви и колекции
        
        for (int x : array3)
         {//променливата x е локална променлив, видима само в for коснтрукцията
          //на всяка итерация (стъпка) променливата x съдържа стойността на текущия елемент
             if (x> temp)
                 temp=x;//ако текущят елемент е по-голям от до сега известния най-голям, то записваме нова най-голяма стойност
         }
        //какво означава едно число да се съдържа в масив? Необходимо е в масива един или повече елементи, които са равни на числото
        //ще използваме Arrays.toString, за изведем масива като един текст
            System.out.print("В масив "+ Arrays.toString(array3) +" най-голямото число е "+ temp);
            
        //Тема за размисъл: какво е необходимо да се промени, за да намерим най-малкия елемент?
    }
    
}
